#### 3.在新数据库中新建一张 user 表,插入几条数据,属性包含:唯一标识(id),姓名(name),性别(sex),年龄(age),联系方式(phone)。

```sql
-- 创建 user 表
CREATE TABLE user (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    sex VARCHAR(10),
    age INT,
    phone VARCHAR(20)
);

-- 插入数据
INSERT INTO user (name, sex, age, phone)
VALUES
    ('John Doe', 'Male', 30, '123-456-7890'),
    ('Jane Smith', 'Female', 25, '987-654-3210'),
    ('Bob Johnson', 'Male', 40, '555-123-4567');
```

#### 4.写出 SQL语句,查询 user 表中所有年龄在 20-30 范围内的用户。

```sql
SELECT * FROM user
WHERE age >= 20 AND age <= 30;
```

#### 5.写出 SQL语句,删除 user 表中名字包含“张”的用户。

```sql
DELETE FROM user
WHERE name LIKE '%张%';
```

#### 6.写出 SQL 语句,计算 user 表中所有用户的平均年龄。

```sql
SELECT AVG(age) AS average_age FROM user;
```

#### 7.写出 SQL语句,查询 user 表中年龄在 20-30 范围内，名字包含“张”的用户,并按照年龄从大到小排序输出。

```sql
SELECT * FROM user
WHERE age >= 20 AND age <= 30 AND name LIKE '%张%'
ORDER BY age DESC;
```

#### 8.新建两张表,team 表(id,teamName),score 表(id,teamid,userid,score)。其中,8.score 表中的 teamid 为指向 team 表id 的外键,userid 为指向 user 表id 的外键

创建team表

```sql
CREATE TABLE team (
    id INT AUTO_INCREMENT PRIMARY KEY,
    teamName VARCHAR(255) NOT NULL
);
```

创建score表

```sql
CREATE TABLE score (
    id INT AUTO_INCREMENT PRIMARY KEY,
    teamid INT,
    userid INT,
    score INT,
    FOREIGN KEY (teamid) REFERENCES team(id),
    FOREIGN KEY (userid) REFERENCES user(id)
);
```

#### 9.写出 SQL 语句,查询 teamName 为“ECNU”的队伍中,年龄小于 20 的用户们。

```sql
SELECT u.* FROM user u
JOIN score s ON u.id = s.userid
JOIN team t ON s.teamid = t.id
WHERE t.teamName = 'ECNU' AND u.age < 20;
```

#### 10.写出 SQL语句,计算 teamName 为“ECNU”的总分(假设 score 存在 null 值,null值默认为 0 加入计算)。

```sql
SELECT t.teamName, COALESCE(SUM(s.score), 0) AS total_score
FROM team t
LEFT JOIN score s ON t.id = s.teamid
WHERE t.teamName = 'ECNU'
GROUP BY t.teamName;
```